export const newsList = [
    {
        title: `“ICT EXPO-2020”-д үнэ төлбөргүй оролцох гарааны компаниуд шалгарлаа`,
        subBody: 'Үзэсгэлэн нь энэ жил уламжлалт болон цахим гэсэн хоёр хэлбэрээр зохион байгуулагдах бөгөөд гарааны компаниудын бүтээгдэхүүн, үйлчилгээг олон нийтэд сурталчлан, таниулах зорилгоор “ICT EXPO-2020” үзэсгэлэнд үнэ төлбөргүй оролцуулахаар сонгон шалгаруулалт зарласан билээ... ',
        image: 'http://ictexpo.mn/cdn/ict-expo-logo-2-810x700.jpg',
        handle: '/',

    },
    {
        title: `“ICT EXPO-2020”-д үнэ төлбөргүй оролцох гарааны компаниуд шалгарлаа`,
        subBody: 'Үзэсгэлэн нь энэ жил уламжлалт болон цахим гэсэн хоёр хэлбэрээр зохион байгуулагдах бөгөөд гарааны компаниудын бүтээгдэхүүн, үйлчилгээг олон нийтэд сурталчлан, таниулах зорилгоор “ICT EXPO-2020” үзэсгэлэнд үнэ төлбөргүй оролцуулахаар сонгон шалгаруулалт зарласан билээ... ',
        image: 'http://ictexpo.mn/cdn/ict-expo-dahua.png',
        handle: '/',

    },
    {
        title: `“ICT EXPO-2020”-д үнэ төлбөргүй оролцох гарааны компаниуд шалгарлаа`,
        subBody: 'Үзэсгэлэн нь энэ жил уламжлалт болон цахим гэсэн хоёр хэлбэрээр зохион байгуулагдах бөгөөд гарааны компаниудын бүтээгдэхүүн, үйлчилгээг олон нийтэд сурталчлан, таниулах зорилгоор “ICT EXPO-2020” үзэсгэлэнд үнэ төлбөргүй оролцуулахаар сонгон шалгаруулалт зарласан билээ... ',
        image: 'http://ictexpo.mn/cdn/ict-expo-logo-2-810x700.jpg',
        handle: '/',

    }
]