import React, { useEffect } from 'react';
import gsap, { TimelineMax } from 'gsap';
import { ScrollTrigger } from 'gsap/ScrollTrigger';
import {
    BrowserRouter as Router,
    Switch,
    Route,
    Link
} from "react-router-dom";
import './ProfilePage.scss'
import HeaderPage from '../../HeaderPage/HeaderPage';
gsap.registerPlugin(ScrollTrigger);
const ProfilePage = () => {
    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);
    useEffect(() => {
        // let sec4 = gsap.timeline({
        //     scrollTrigger: {
        //         trigger: '.r-sec',
        //         start: 'top top',
        //         end: 'bottom center+=36',
        //         scrub: 1.5,
        //         pin: '.img-anim1',
        //         markers: true,
        //     },
        // });
        
        // sec4.fromTo('.img-anim2',
        //     {
        //         y: '1000px',
        //         duration: 1,

        //     },
        //     {
        //         y: '-100%'

        //     });

        gsap.set("#video-anim", { xPercent: -50, yPercent: -50 });
        gsap.to("#video-anim", {
            scale: 0.6667, scrollTrigger: {
                trigger: ".video-section",
                pin: ".video-section",
                scrub: true
            }
        })
    }, []);
    return (
        <section className="companyProfile">
            <HeaderPage></HeaderPage>
            <div className="page-header">
                <div className="caption-box">
                    <div className="logo-box">
                        <img src="http://ictexpo.mn/cdn/120141030_1016015418860372_5090666929216621320_n.png"></img>
                    </div>
                    {/* <h1>Скайтел ХХК</h1> */}
                </div>
            </div>
            <div className="header-back">
                <div className="back-btn">
                    <svg width="19" height="9" viewBox="0 0 19 9" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M0.146446 4.14645C-0.0488148 4.34171 -0.0488148 4.65829 0.146446 4.85355L3.32843 8.03553C3.52369 8.2308 3.84027 8.2308 4.03553 8.03553C4.2308 7.84027 4.2308 7.52369 4.03553 7.32843L1.20711 4.5L4.03553 1.67157C4.2308 1.47631 4.2308 1.15973 4.03553 0.964466C3.84027 0.769204 3.52369 0.769204 3.32843 0.964466L0.146446 4.14645ZM18.5 4L0.5 4V5L18.5 5V4Z" fill="white"></path></svg>
                    <Link to="/">Нүүр хуудас</Link>
                </div>
                {/* <div className="back-btn">
                    <Link to="/CompanyListPage">Байгууллагууд</Link>
                </div> */}
            </div>
            <div className="grid-container">
                <div className="body-box">
                    <div className="grid-col">
                        <div className="l-sec">
                            <div className="sec1">
                                <div className="logo-box">
                                    <h1>Скайтел ХХК</h1>
                                    <p>
                                        СКАЙтел ХХК нь 1999 оноос Монголын үүрэн холбооны зах зээлд үйл ажиллагаагаа эхэлсэн бөгөөд  дэлхий дахины хөгжлийн чиг хандлагын дагуу технологийн шинэчлэлүүдийг нэвтрүүлэн, хэрэглэгчдийнхээ хүсэл сонирхолд нийцсэн бүтээгдэхүүн үйлчилгээг хүргэсээр ирсэн. Танд SKYtel, SKYmedia, SKYgo гэх мэт олон төрлийн үйлчилгээг санал болгож байна.
                                    </p>
                                </div>
                                <div className="desc-box">
                                    <div className="desc-widget">
                                        <h1>Үйл ажиллагааны чиглэл</h1>
                                        <p>Харилцаа холбоо, мэдээллийн технологи </p>
                                    </div>

                                </div>

                            </div>
                            <div className="sec2">
                                <div className="title">
                                    <h1>Бүтээгдэхүүн үйлчилгээ</h1>
                                </div>
                                <div className="grid-col">
                                    <div className="col1-box">
                                        <svg width="43" height="43" viewBox="0 0 43 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="21.54" cy="21.8284" r="20.4066" stroke="black" stroke-width="1.2" />
                                            <path d="M10.4 22.7831L16.9248 29.1488L32.6797 14.5078" stroke="black" />
                                        </svg>
                                        <h1>DO DATA үйлчилгээ</h1>
                                        <p>
                                            Дата хэрэглээ ихтэй хэрэглэгчдэд зориулсан урьдчилсан төлбөрт үйлчилгээ юм. Цэнэглэлт бүрд фэйсбүүк, чат багц, дата эрх дагалдана. Дижитал ертөнцийн ус агаар DO
                                        </p>
                                    </div>
                                    <div className="col1-box">
                                        <svg width="43" height="43" viewBox="0 0 43 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="21.54" cy="21.8284" r="20.4066" stroke="black" stroke-width="1.2" />
                                            <path d="M10.4 22.7831L16.9248 29.1488L32.6797 14.5078" stroke="black" />
                                        </svg>
                                        <h1>МОНГОЛдоо дижитал багц</h1>
                                        <p>
                                            Дараа төлбөрт МОНГОЛдоо үйлчилгээ дижитал багцтай болж шинэчлэгдсэн. Хэрэглэгч Socialin’, Content, Gaming, Music багцаас өөрийн хэрэглээндээ тохируулан идэвхжүүлэх боломжтой.
                                        </p>
                                    </div>
                                    <div className="col1-box">
                                        <svg width="43" height="43" viewBox="0 0 43 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="21.54" cy="21.8284" r="20.4066" stroke="black" stroke-width="1.2" />
                                            <path d="M10.4 22.7831L16.9248 29.1488L32.6797 14.5078" stroke="black" />
                                        </svg>
                                        <h1>СКАЙмедиа-UP багц</h1>
                                        <p>
                                            “UP+” дөрөвлөсөн үйлчилгээ нь интернэт, үүрэн холбооны дараа төлбөрт МОНГОЛдоо багц, видео сан болон SkyGO үйлчилгээг нэгтгэснээрээ онцлогтой юм. Хэрэглэгчдэд хамгийн таатай нөхцөл, хэмнэлттэй үнийг санал болгодог.
                                        </p>
                                    </div>
                                </div>
                            </div>

                            {/* <div className="sec4">

                                <div className="grid-col">
                                    <div className="grid-l">
                                        <div className="col1-box">
                                            <svg width="13" height="19" viewBox="0 0 13 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M6.30664 18.446C2.13968 13.0085 0.0566406 9.13976 0.0566406 6.83887C0.0566406 6.01811 0.218302 5.20538 0.532393 4.4471C0.846485 3.68881 1.30686 2.99982 1.88722 2.41945C2.46759 1.83908 3.15658 1.37871 3.91487 1.06462C4.67315 0.750528 5.48588 0.588867 6.30664 0.588867C7.1274 0.588867 7.94013 0.750528 8.69841 1.06462C9.4567 1.37871 10.1457 1.83908 10.7261 2.41945C11.3064 2.99982 11.7668 3.68881 12.0809 4.4471C12.395 5.20538 12.5566 6.01811 12.5566 6.83887C12.5566 9.13976 10.4736 13.0085 6.30664 18.446ZM6.30664 10.4103C7.25384 10.4103 8.16225 10.034 8.83202 9.36425C9.50179 8.69448 9.87807 7.78607 9.87807 6.83887C9.87807 5.89167 9.50179 4.98326 8.83202 4.31349C8.16225 3.64371 7.25384 3.26744 6.30664 3.26744C5.35944 3.26744 4.45103 3.64371 3.78126 4.31349C3.11149 4.98326 2.73521 5.89167 2.73521 6.83887C2.73521 7.78607 3.11149 8.69448 3.78126 9.36425C4.45103 10.034 5.35944 10.4103 6.30664 10.4103Z" fill="black" />
                                            </svg>
                                            <p>
                                                14251 Улаанбаатар, Сүхбаатар дүүрэг, 1-р хороо, Чингисийн өргөн чөлөө 9, Скайтел Плаза
                                            </p>
                                        </div>
                                        <div className="col1-box">
                                            <svg width="13" height="10" viewBox="0 0 13 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M6.50049 5L0.00683594 1.96484V1.25C0.00683594 1.03906 0.0871611 0.861328 0.247812 0.716797C0.408462 0.572266 0.598706 0.5 0.818543 0.5H12.1824C12.4023 0.5 12.5925 0.572266 12.7532 0.716797C12.9138 0.861328 12.9942 1.03906 12.9942 1.25V1.96484L6.50049 5ZM6.09464 5.75H6.90635L12.9942 2.83203V8.75C12.9942 8.95312 12.9138 9.12891 12.7532 9.27734C12.5925 9.42578 12.4023 9.5 12.1824 9.5H0.818543C0.598706 9.5 0.408462 9.42578 0.247812 9.27734C0.0871611 9.12891 0.00683594 8.95312 0.00683594 8.75V2.83203L6.09464 5.75Z" fill="black" />
                                            </svg>
                                            <p>info@skytel.mn</p>
                                        </div>
                                        <div className="col1-box">
                                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M14.3456 11.8843C14.3122 11.6779 14.1828 11.5015 13.989 11.3967L11.122 9.70749L11.0984 9.69429C10.9782 9.63412 10.8454 9.60328 10.711 9.60429C10.4708 9.60429 10.2414 9.69529 10.0822 9.85489L9.23598 10.7015C9.19977 10.7359 9.08177 10.7857 9.04597 10.7875C9.03617 10.7867 8.06137 10.7165 6.26677 8.92169C4.47536 7.13069 4.39936 6.15288 4.39876 6.15288C4.39976 6.10288 4.44896 5.98528 4.48396 5.94888L5.20556 5.22748C5.45976 4.97268 5.53596 4.55028 5.38516 4.22308L3.79156 1.22447C3.67576 0.986068 3.45076 0.838867 3.20116 0.838867C3.02456 0.838867 2.85416 0.912067 2.72096 1.04507L0.75395 3.00767C0.56535 3.19527 0.402949 3.52328 0.367549 3.78728C0.350349 3.91348 0.00134784 6.92588 4.13136 11.0565C7.63757 14.5623 10.3716 14.8347 11.1266 14.8347C11.2185 14.8359 11.3104 14.8311 11.4018 14.8205C11.665 14.7853 11.9926 14.6233 12.18 14.4355L14.1454 12.4703C14.3058 12.3091 14.379 12.0961 14.3456 11.8843Z" fill="black" />
                                            </svg>
                                            <p>
                                                +(976) 7676-9000
                                    </p>
                                        </div>
                                    </div>
                                    <div className="grid-r">
                                        <div className="col1-box">
                                            <svg width="10" height="19" viewBox="0 0 10 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M6.39996 18.336V10.14H9.16496L9.57596 6.93104H6.39996V4.88704C6.39996 3.96104 6.65796 3.32704 7.98696 3.32704H9.67096V0.466036C8.8516 0.378227 8.02801 0.335829 7.20396 0.339036C4.75996 0.339036 3.08196 1.83104 3.08196 4.57004V6.92504H0.334961V10.134H3.08796V18.336H6.39996Z" fill="black" />
                                            </svg>

                                            <p>
                                                Facebook
                                    </p>
                                        </div>
                                        <div className="col1-box">
                                            <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M8.50064 4.47503C6.08718 4.47503 4.1394 6.42281 4.1394 8.83627C4.1394 11.2497 6.08718 13.1975 8.50064 13.1975C10.9141 13.1975 12.8619 11.2497 12.8619 8.83627C12.8619 6.42281 10.9141 4.47503 8.50064 4.47503ZM8.50064 11.6708C6.93987 11.6708 5.66616 10.397 5.66616 8.83627C5.66616 7.27549 6.93987 6.00178 8.50064 6.00178C10.0614 6.00178 11.3351 7.27549 11.3351 8.83627C11.3351 10.397 10.0614 11.6708 8.50064 11.6708ZM13.0405 3.27999C12.477 3.27999 12.022 3.73504 12.022 4.29854C12.022 4.86203 12.477 5.31708 13.0405 5.31708C13.604 5.31708 14.059 4.86416 14.059 4.29854C14.0592 4.16473 14.033 4.03221 13.9819 3.90856C13.9307 3.78491 13.8557 3.67256 13.7611 3.57794C13.6665 3.48333 13.5541 3.40831 13.4305 3.35718C13.3068 3.30606 13.1743 3.27982 13.0405 3.27999ZM17.002 8.83627C17.002 7.6625 17.0126 6.49936 16.9467 5.32771C16.8808 3.96682 16.5703 2.75903 15.5752 1.76387C14.5779 0.76659 13.3722 0.458263 12.0113 0.392345C10.8376 0.326426 9.67442 0.337058 8.50277 0.337058C7.329 0.337058 6.16586 0.326426 4.99422 0.392345C3.63332 0.458263 2.42553 0.768717 1.43037 1.76387C0.433094 2.76115 0.124767 3.96682 0.0588485 5.32771C-0.00706984 6.50149 0.00356217 7.66463 0.00356217 8.83627C0.00356217 10.0079 -0.00706984 11.1732 0.0588485 12.3448C0.124767 13.7057 0.435221 14.9135 1.43037 15.9087C2.42765 16.906 3.63332 17.2143 4.99422 17.2802C6.16799 17.3461 7.33113 17.3355 8.50277 17.3355C9.67654 17.3355 10.8397 17.3461 12.0113 17.2802C13.3722 17.2143 14.58 16.9038 15.5752 15.9087C16.5725 14.9114 16.8808 13.7057 16.9467 12.3448C17.0147 11.1732 17.002 10.01 17.002 8.83627ZM15.1308 13.8503C14.9755 14.2373 14.7884 14.5265 14.4886 14.8242C14.1888 15.124 13.9017 15.3112 13.5147 15.4664C12.3962 15.9108 9.74033 15.8109 8.50064 15.8109C7.26096 15.8109 4.60296 15.9108 3.48447 15.4685C3.09747 15.3133 2.80828 15.1262 2.51058 14.8263C2.21076 14.5265 2.02364 14.2394 1.86841 13.8524C1.42612 12.7318 1.52606 10.076 1.52606 8.83627C1.52606 7.59658 1.42612 4.93858 1.86841 3.8201C2.02364 3.43309 2.21076 3.1439 2.51058 2.84621C2.81041 2.54851 3.09747 2.35926 3.48447 2.20404C4.60296 1.76174 7.26096 1.86169 8.50064 1.86169C9.74033 1.86169 12.3983 1.76174 13.5168 2.20404C13.9038 2.35926 14.193 2.54639 14.4907 2.84621C14.7905 3.14603 14.9777 3.43309 15.1329 3.8201C15.5752 4.93858 15.4752 7.59658 15.4752 8.83627C15.4752 10.076 15.5752 12.7318 15.1308 13.8503Z" fill="black" />
                                            </svg>
                                            <p>
                                                Instagram
                                    </p>
                                        </div>
                                        <div className="col1-box">
                                            <svg width="18" height="15" viewBox="0 0 18 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M17.0029 1.97649C16.3778 2.24617 15.6974 2.44026 14.9967 2.51585C15.7242 2.08362 16.2691 1.40077 16.5289 0.59541C15.8462 1.00154 15.0983 1.28633 14.3184 1.43714C13.9924 1.08865 13.5982 0.81103 13.1602 0.621576C12.7223 0.432121 12.25 0.334892 11.7728 0.335946C9.84213 0.335946 8.28943 1.9009 8.28943 3.82135C8.28943 4.09102 8.32212 4.3607 8.37524 4.62017C5.48436 4.46898 2.90607 3.0879 1.19197 0.973369C0.879643 1.50683 0.715973 2.11425 0.717988 2.73241C0.717988 3.94188 1.33294 5.00834 2.27069 5.63555C1.71806 5.61379 1.17837 5.46189 0.695515 5.19221V5.23512C0.695515 6.92878 1.89273 8.33234 3.48833 8.65514C3.18874 8.73296 2.88054 8.77277 2.57101 8.77364C2.34423 8.77364 2.12972 8.75116 1.91316 8.72052C2.35445 10.1016 3.63951 11.1047 5.16974 11.1374C3.97252 12.0752 2.47295 12.6268 0.844656 12.6268C0.552503 12.6268 0.282824 12.6166 0.00292969 12.5839C1.54746 13.5747 3.38005 14.1468 5.35361 14.1468C11.7605 14.1468 15.2664 8.83901 15.2664 4.23199C15.2664 4.08081 15.2664 3.92963 15.2561 3.77844C15.9344 3.28199 16.5289 2.66704 17.0029 1.97649Z" fill="black" />
                                            </svg>
                                            <p>
                                                Twitter
                                    </p>
                                        </div>
                                        <div className="col1-box">
                                            <svg width="18" height="13" viewBox="0 0 18 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M16.6481 2.19721C16.5514 1.83679 16.3616 1.50811 16.0979 1.24406C15.8342 0.980016 15.5057 0.789863 15.1455 0.692634C13.8192 0.335938 8.50293 0.335938 8.50293 0.335938C8.50293 0.335938 3.18664 0.335937 1.86041 0.690737C1.49996 0.78765 1.17135 0.977698 0.907584 1.24179C0.64382 1.50589 0.454187 1.83474 0.357729 2.19531C0.00292962 3.52344 0.00292969 6.29353 0.00292969 6.29353C0.00292969 6.29353 0.00292962 9.06362 0.357729 10.3898C0.553153 11.1222 1.12994 11.699 1.86041 11.8944C3.18664 12.2511 8.50293 12.2511 8.50293 12.2511C8.50293 12.2511 13.8192 12.2511 15.1455 11.8944C15.8778 11.699 16.4527 11.1222 16.6481 10.3898C17.0029 9.06362 17.0029 6.29353 17.0029 6.29353C17.0029 6.29353 17.0029 3.52344 16.6481 2.19721ZM6.81431 8.83594V3.75112L11.2161 6.27455L6.81431 8.83594Z" fill="black" />
                                            </svg>
                                            <p>
                                                Youtube
                                    </p>
                                        </div>
                                    </div>

                                </div>
                            </div> */}
                        </div>
                        <div className="r-sec">
                            <img className="img-anim1" src="http://ictexpo.mn/cdn/new/119954098_771461266975161_8383235991283666644_n.png"></img>
                            <img className="img-anim2" src="http://ictexpo.mn/cdn/new/120162457_3377991875597175_2903176797710788242_n.png"></img>
                        </div>
                    </div>
                </div>
            </div>
            <div className="container-fluid p-0">
                <div className="video-section">
                    <div className="video-text">
                        <h1>Танд SKYtel, SKYmedia, SKYgo үйлчилгээг санал болгож байна</h1>
                    </div>
                    <video autoPlay muted loop id="video-anim">
                        <source src="http://ictexpo.mn/cdn/Skytel%20short%20edited.mp4" type="video/mp4">
                        </source>
                    </video>

                </div>
                <div className="product-info">
                    <h1>
                        МОНГОЛдоо дижитал багц
                        </h1>
                    <img src="http://ictexpo.mn/cdn/new/mongoldoo%201080.png"></img>
                </div>
                <div className="product-info">
                    <h1>
                        DO DATA үйлчилгээ
                        </h1>
                    <img src="http://ictexpo.mn/cdn/new/do%201080.png"></img>
                </div>
                <div className="product-info">
                    <h1>
                        СКАЙмедиа-UP багц
                        </h1>
                    <img src="http://ictexpo.mn/cdn/new/UP%201920x1080.jpg"></img>
                </div>
            </div>


        </section>
    )
}
export default ProfilePage;